{
  "slug": "wizard",
  "api_url": "https://api.open5e.com/v1/classes/wizard/",
  "data": {
    "name": "Wizard",
    "slug": "wizard",
    "desc": "### Spellcasting \n \nAs a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. \n \n#### Cantrips \n \nAt 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table. \n \n#### Spellbook \n \nAt 1st level, you have a spellbook containing six 1st- level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind.\n \n> ### Your Spellbook \n> \n> The spells that you add to your spellbook as you gain levels reflect the arcane research you conduct on your own, as well as intellectual breakthroughs you have had about the nature of the multiverse. You might find other spells during your adventures. You could discover a spell recorded on a scroll in an evil wizard's chest, for example, or in a dusty tome in an ancient library. \n> \n> **_Copying a Spell into the Book._** When you find a wizard spell of 1st level or higher, you can add it to your spellbook if it is of a spell level you can prepare and if you can spare the time to decipher and copy it. \n> \n> Copying that spell into your spellbook involves reproducing the basic form of the spell, then deciphering the unique system of notation used by the wizard who wrote it. You must practice the spell until you understand the sounds or gestures required, then transcribe it into your spellbook using your own notation. \n> \n> For each level of the spell, the process takes 2 hours and costs 50 gp. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it. Once you have spent this time and money, you can prepare the spell just like your other spells. \n> \n> **_Replacing the Book._** You can copy a spell from your own spellbook into another book-for example, if you want to make a backup copy of your spellbook. This is just like copying a new spell into your spellbook, but faster and easier, since you understand your own notation and already know how to cast the spell. You need spend only 1 hour and 10 gp for each level of the copied spell. \n> \n> If you lose your spellbook, you can use the same procedure to transcribe the spells that you have prepared into a new spellbook. Filling out the remainder of your spellbook requires you to find new spells to do so, as normal. For this reason, many wizards keep backup spellbooks in a safe place. \n> \n> **_The Book's Appearance._** Your spellbook is a unique compilation of spells, with its own decorative flourishes and margin notes. It might be a plain, functional leather volume that you received as a gift from your master, a finely bound gilt-edged tome you found in an ancient library, or even a loose collection of notes scrounged together after you lost your previous spellbook in a mishap.\n \n#### Preparing and Casting Spells \n \nThe Wizard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nYou prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots. \n \nFor example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell *magic missile,* you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. \n \nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list. \n \n#### Spellcasting Ability \n \nIntelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Intelligence modifier \n \n**Spell attack modifier** = your proficiency bonus + your Intelligence modifier \n \n#### Ritual Casting \n \nYou can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared. \n \n#### Spellcasting Focus \n \nYou can use an arcane focus as a spellcasting focus for your wizard spells. \n \n#### Learning Spells of 1st Level and Higher \n \nEach time you gain a wizard level, you can add two wizard spells of your choice to your spellbook for free. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook (see the “Your Spellbook” sidebar).\n \n### Arcane Recovery \n \nYou have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher. \n \nFor example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots. \n \n### Arcane Tradition \n \nWhen you reach 2nd level, you choose an arcane tradition, shaping your practice of magic through one of eight schools: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation, all detailed at the end of the class description. \n \nYour choice grants you features at 2nd level and again at 6th, 10th, and 14th level. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Spell Mastery \n \nAt 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. \n \nBy spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels. \n \n### Signature Spells \n \nWhen you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest. \n \nIf you want to cast either spell at a higher level, you must expend a spell slot as normal. \n \n### Arcane Traditions \n \nThe study of wizardry is ancient, stretching back to the earliest mortal discoveries of magic. It is firmly established in fantasy gaming worlds, with various traditions dedicated to its complex study. \n \nThe most common arcane traditions in the multiverse revolve around the schools of magic. Wizards through the ages have cataloged thousands of spells, grouping them into eight categories called schools. In some places, these traditions are literally schools; a wizard might study at the School of Illusion while another studies across town at the School of Enchantment. In other institutions, the schools are more like academic departments, with rival faculties competing for students and funding. Even wizards who train apprentices in the solitude of their own towers use the division of magic into schools as a learning device, since the spells of each school require mastery of different techniques.",
    "hit_dice": "1d6",
    "hp_at_1st_level": "6 + your Constitution modifier",
    "hp_at_higher_levels": "1d6 (or 4) + your Constitution modifier per wizard level after 1st",
    "prof_armor": "None",
    "prof_weapons": "Daggers, darts, slings, quarterstaffs, light crossbows",
    "prof_tools": "None",
    "prof_saving_throws": "Intelligence, Wisdom",
    "prof_skills": "Choose two from Arcana, History, Insight, Investigation, Medicine, and Religion",
    "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n* *(a)* a quarterstaff or (*b*) a dagger \n* *(a)* a component pouch or (*b*) an arcane focus \n* *(a)* a scholar's pack or (*b*) an explorer's pack \n* A spellbook",
    "table": "| Level | Proficiency Bonus | Features                       | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th | \n|-------|-------------------|--------------------------------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----| \n| 1st   | +2                | Spellcasting, Arcane Recovery  | 3              | 2   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 2nd   | +2                | Arcane Tradition               | 3              | 3   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 3rd   | +2                | -                              | 3              | 4   | 2   | -   | -   | -   | -   | -   | -   | -   | \n| 4th   | +2                | Ability Score Improvement      | 4              | 4   | 3   | -   | -   | -   | -   | -   | -   | -   | \n| 5th   | +3                | -                              | 4              | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   | \n| 6th   | +3                | Arcane Tradition Feature       | 4              | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   | \n| 7th   | +3                | -                              | 4              | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   | \n| 8th   | +3                | Ability Score Improvement      | 4              | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   | \n| 9th   | +4                | -                              | 4              | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   | \n| 10th  | +4                | Arcane Tradition Feature       | 5              | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   | \n| 11th  | +4                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 12th  | +4                | Ability Score Improvement      | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 13th  | +5                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 14th  | +5                | Arcane Tradition Feature       | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 15th  | +5                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 16th  | +5                | Ability Score Improvement      | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 17th  | +6                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   | \n| 18th  | +6                | Spell Mastery                  | 5              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   | \n| 19th  | +6                | Ability Score Improvement      | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | \n| 20th  | +6                | Signature Spell                | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
    "spellcasting_ability": "Intelligence",
    "subtypes_name": "Arcane Traditions",
    "archetypes": [
      {
        "name": "School of Evocation",
        "slug": "school-of-evocation",
        "desc": "You focus your study on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some evokers find employment in military forces, serving as artillery to blast enemy armies from afar. Others use their spectacular power to protect the weak, while some seek their own gain as bandits, adventurers, or aspiring tyrants. \n \n##### Evocation Savant \n \nBeginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved. \n \n##### Sculpt Spells \n \nBeginning at 2nd level, you can create pockets of relative safety within the effects of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save. \n \n##### Potent Cantrip \n \nStarting at 6th level, your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip's damage (if any) but suffers no additional effect from the cantrip. \n \n##### Empowered Evocation \n \nBeginning at 10th level, you can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast. \n \n##### Overchannel \n \nStarting at 14th level, you can increase the power of your simpler spells. When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell. \n \nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"
      },
      {
        "name": "Cantrip Adept",
        "slug": "cantrip-adept",
        "desc": "It's easy to dismiss the humble cantrip as nothing more than an unsophisticated spell practiced by hedge wizards that proper mages need not focus on. But clever and cautious wizards sometimes specialize in such spells because while other mages fret when they're depleted of arcane resources, Cantrip Adepts hardly even notice … and at their command, the cantrips are not so humble.\n\n##### Cantrip Polymath\nAt 2nd level, you gain two cantrips of your choice from any spell list. For you, these cantrips count as wizard cantrips and don't count against the number of cantrips you know. In addition, any cantrip you learn or can cast from any other source, such as from a racial trait or feat, counts as a wizard cantrip for you.\n\n##### Arcane Alacrity\nAlso at 2nd level, whenever you cast a wizard cantrip that has a casting time of an action, you can change the casting time to a bonus action for that casting. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses of it when you finish a long rest.\n  When you reach 10th level in this class, you regain all expended uses of this feature when you finish a short or long rest.\n\n##### Potent Spellcasting\nStarting at 6th level, you can add your Intelligence modifier to one damage roll of any wizard cantrip you can cast.\n\n##### Adroit Caster\nStarting at 10th level, if you cast a cantrip that doesn't deal damage or a cantrip that has an effect in addition to damage, such as the speed reduction of the *ray of frost* spell, that cantrip or effect has twice the normal duration.\n\n##### Empowered Cantrips\nStarting at 14th level, once per turn, when you cast a wizard cantrip that deals damage, you can deal maximum damage with that spell. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses of it when you finish a long rest.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Courser Mage",
        "slug": "courser-mage",
        "desc": "A tradition more focused on stalking prey than reading dozens of books, courser mages generally choose more subtle spells that aid in finding or hiding from their enemies. They learn to imbue their arrows with spell energy to deliver more deadly shots.\n\n##### Stalking Savant\nAt 2nd level, you gain proficiency with longbows and shortbows, and you gain proficiency in the Stealth skill. In addition, you can still perform the somatic components of wizard spells even when you have a longbow or shortbow in one or both hands.\n\n##### Unseen Assailant\nStarting at 2nd level, as a bonus action, you can choose a target you can see within 60 feet of you and become invisible to that target until the start of your next turn. Once the effect ends, you can't use this feature on that target again until you finish a long rest.\n\n##### Spell Arrow\nBeginning at 6th level, you can imbue an arrow you fire from a longbow or shortbow with magical energy. As a bonus action, you can expend a 1st-level spell slot to cause the next arrow you fire to magically deal an extra 2d4 force damage to the target on a hit. If you expend a spell slot of 2nd level or higher, the extra damage increases by 1d4 for each slot level above 1st.\n\n##### Pinpoint Weakness\nAt 10th level, when you hit a creature with an arrow imbued by your Spell Arrow feature, your next ranged weapon attack against that creature has advantage.\n\n##### Multitudinous Arrows\nStarting at 14th level, you can attack twice, instead of once, whenever you take the Attack action with a longbow or shortbow on your turn. If you use your Spell Arrow feature, you can imbue both arrows with arcane power by expending one spell slot. If you imbue two arrows with this feature, you can't cast spells other than cantrips until the end of your next turn.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Familiar Master",
        "slug": "familiar-master",
        "desc": "Each wizard has a strong connection with their familiar, but some mages eschew specializing in a school of magic in favor of forming a powerful bond with a familiar. This bond allows the two to work in tandem in ways that few arcane practitioners could even dream of. Those who encounter such a familiar never look at a rodent or bird the same way again.\n\n##### Familiar Savant\nBeginning when you select this arcane tradition at 2nd level, you learn the *find familiar* spell if you don't know it already. You innately know this spell and don't need to have it scribed in your spellbook or prepared in order to cast it. When you cast *find familiar*, the casting time is 1 action, and it requires no material components.\n  You can cast *find familiar* without expending a spell slot. You can do so a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n  In addition, when you cast the *find familiar* spell, you can choose for your familiar to take the form of any Small or smaller beast that is CR 1/4 or lower, such as a flying snake, giant moth (see *Creature Codex*), or giant armadillo (see *Tome of Beasts 2*). The familiar has the statistics of the chosen beast form, but it is a celestial, fey, or fiend (your choice) instead of a beast.\n  When you reach 6th level in this class, your familiar can take the form of any Small or smaller beast that is CR 1 or lower. Alternatively, at the GM's discretion, your familiar can be any Tiny celestial, dragon, fey, or fiend that is CR 1 or lower.\n\n##### Greater Familiar\nAlso at 2nd level, when you cast *find familiar*, your familiar gains the following additional benefits: \n* Your familiar adds your proficiency bonus to its Armor Class, and it uses your proficiency bonus in place of its own when making ability checks and saving throws. It is proficient in any saving throw in which you are proficient. \n* Your familiar's hit points equal its normal hit point maximum or 1 + your Intelligence modifier + three times your wizard level, whichever is higher. It has a number of Hit Dice (d4s) equal to your wizard level. \n* In combat, your familiar shares your initiative and takes its turn immediately after yours. It can move and use its reaction on its own, but, if you don't issue any commands to it, the only action it takes is the Dodge action. You can use your bonus action to direct it to take any action in its stat block or some other action. If you are incapacitated, the familiar can take any action of its choice, not just Dodge. \n* Your familiar's attacks are enhanced by the magic bond you share with it. When making attack rolls, your familiar uses your spell attack bonus or its normal attack bonus, whichever is higher. In addition, when your familiar hits with an attack, the attack deals force damage equal to 1d4 + its Strength or Dexterity modifier (your choice) + your proficiency bonus instead of its normal damage. If the familiar's attack normally deals additional damage, such as a flying snake's poison, or has an additional effect, such as an octopus's grapple, the familiar's attack still has that additional damage or effect. \n* Your familiar's Intelligence increases to 8 unless it is already higher. It can understand and speak Common and either Celestial (if celestial), Sylvan (if fey), or Abyssal or Infernal (if fiend).\n\n##### Strengthened Bond\nStarting at 6th level, your magical bond with your familiar grows stronger. If your familiar has a trait or action that forces a creature to make a saving throw, it uses your spell save DC. In addition, you can access your familiar's senses by using either an action or a bonus action, and whenever your familiar is within 100 feet of you, it can expend its reaction to deliver any wizard spell you cast. If the spell has a range of 5 feet or more, you must be sharing your familiar's senses before casting the spell. If the spell requires an attack roll, ability check, or saving throw, you use your own statistics to adjudicate the result.\n\n##### Arcane Amplification\nStarting at 10th level, you can add your Intelligence modifier to one damage roll of any wizard spell you cast through your familiar. In addition, your familiar has advantage on saving throws against spells and other magical effects.\n\n##### Companion Concentration\nStarting at 14th level, when you are concentrating on a spell of 3rd level or lower, you can use an action to draw on your connection with your familiar to pass the burden of concentration onto it, freeing you up to concentrate on a different spell. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Gravebinding",
        "slug": "gravebinding",
        "desc": "While most wizards who desire power over the dead focus their efforts on necromancy, there are other, rarer, paths one can choose. Gravebinders focus their efforts on safeguarding tombs and graveyards to ensure the dead remain at rest and the living remain safe from the dead. When undead rise to prey upon the living, a gravebinder hunts downs the abominations and returns them to their eternal slumber.\n\n##### Restriction: The Dead Must Rest\nWhen you choose this wizard arcane tradition, you can no longer cast spells that animate, conjure, or create undead, and, if any such spells are copied in your spellbook, they fade from the book within 24 hours, leaving blank pages where the spells were.\n\n##### Gravebinder Lore\nAt 2nd level, you can use an action to inscribe a small rune on a corpse. While this rune remains, the corpse can't become undead. You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.\n  In addition, you have proficiency in the Religion skill if you don't already have it, and you have advantage on Intelligence (Religion) checks made to recall lore about deities of death, burial practices, and the afterlife.\n\n##### Hunter of the Dead\nStarting at 2nd level, you gain access to spells passed down by generations of gravebinders. The *heart to heart* (2nd), *dead walking* (3rd), *gird the spirit* (3rd), *life from death* (5th), and *lay to rest* (9th) spells are wizard spells for you, and you add them to your spellbook at the indicated wizard levels (see the Magic and Spells chapter for details on these spells). Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.\n  Also at 2nd level, you can use your action and expend one wizard spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether undead are present within 1 mile of you. You know the general direction of the undead creatures, though not their exact locations or numbers, and you know the direction of the most powerful undead within range.\n\n##### Ward Against the Risen\nStarting at 6th level, when an undead creature you can see within 30 feet of you targets an ally with an attack or spell, you can use your reaction to hamper the attack or spell. The undead has disadvantage on its attack roll or your ally has advantage on its saving throw against the undead's spell. You can use this feature a number of times equal to your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.\n\n##### Disruptive Touch\nBeginning at 10th level, when an undead creature takes damage from a 1st-level or higher spell you cast, it takes an extra 4d6 radiant damage. Undead creatures you kill using this feature are destroyed in a puff of golden motes.\n\n##### Radiant Nimbus\nAt 14th level, you can use your action to envelope yourself in a shroud of golden flames for 1 minute. While enveloped, you gain the following benefits: \n* When you summon the flames and as an action on each of your turns while the flames are active, you can frighten undead within 30 feet of you. Each undead creature in the area must succeed on a Wisdom saving throw or be frightened of you until the flames fade or until it takes damage. An undead creature with sunlight sensitivity (or hypersensitivity, in the case of vampires) also takes 4d6 radiant damage if it fails the saving throw. \n* You shed bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight. \n* When an undead creature hits you with a melee weapon attack, it takes 2d10 radiant damage.\nOnce you use this feature, you can't use it again until you finish a long rest.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "School of Liminality",
        "slug": "school-of-liminality",
        "desc": "Liminal spaces are spaces on the boundary, at the edge between what's real and what's unreal. A liminal space can be neither here nor there, and yet be both *here and there* at the same time. Stories of liminal spaces are common across cultures, though their true nature often isn't recognized by the uninitiated: the stranger who appears suddenly at a lonely crossroads, the troll that snatches at unwary travelers from a hiding spot beneath a bridge where no such hiding spot exists, the strangely familiar yet unsettlingly different scene that's sometimes glimpsed in a looking glass.\n  These are only the most obvious encounters with liminal spaces! Most liminalities are more easily overlooked, being as unconscious as the heartbeat between waking and sleeping, as fleeting as drawing in breath as an apprentice and exhaling it as a master, or as unassumingly familiar—and as fraught with potential—as a doorway that's crossed a hundred times without incident.\n  Those who specialize in liminal magic are known as liminists. They've learned to tap into the mysticism at the heart of spaces between spaces and to bend the possibilities inherent in transitional moments to their own ends. Like filaments of a dream, strands of liminality can be woven into forms new and wondrous—or strange and terrifying.\n\n##### Liminal Savant\nBeginning when you select this school at 2nd level, the gold and time you must spend to copy a liminal spell (see the Magic and Spells chapter) into your spellbook is halved.\n\n##### Mulligan\nAt 2nd level, you can control the moment between an attempt at something and the result of that attempt to shift the flow of battle in your favor. When a creature you can see within 30 feet of you misses with an attack, you can use your reaction to allow that creature to reroll the attack. Similarly, when a creature within 30 feet of you that you can see hits with an attack but hasn't yet rolled damage, you can use your reaction to force that creature to reroll the attack and use the lower result. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n  When you reach 10th level in this class, you can use this feature when a creature you can see within 30 feet of you makes an ability check or saving throw.\n\n##### Otherworldly Sense\nAt 6th level, if you spend 1 minute meditating and expanding your senses outward, you can sense those not of this world—those who slip through the cracks of the in-between to wreak havoc on the unsuspecting. For 10 minutes, you can sense whether the following types of creatures are present within 1 mile of you: aberrations, celestials, dragons, elementals, fey, fiends, and undead. As long as you maintain your concentration, you can use an action to change the type of creature you sense. You know the direction to each lone creature or group, but not the distance or the exact number in a group. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n\n##### Liminal Adept\nAt 10th level, you add the *threshold slip* spell (see the Magic and Spells chapter) to your spellbook, if it isn't there already. You can cast *threshold slip* without expending a spell slot. When you do so, you can bring up to two willing creatures of your size or smaller that you're touching with you. The target junction must have unoccupied spaces for all of you to enter when you reappear, or the spell fails.\n  You can use this feature twice. You regain all expended uses when you finish a short or long rest. When you reach 14th level in this class, you can use this feature three times between rests.\n\n##### Forced Transition\nAt 14th level, your mastery over moments of change is unequivocal. You can use an action to touch a willing creature or make a melee spell attack against an unwilling creature, choosing one of the following effects. The effect lasts for 1 minute. Once you use this feature, you can't use it again until you finish a long rest.\n\n***Rapid Advancement.*** The target's ability scores are each increased by 2. An ability score can exceed 20 but can't exceed 24.\n\n***Regression.*** The target's ability scores are each reduced by 2. This effect can't reduce an ability score below 1.\n\n***True Self.*** The target can't change its shape through any means, including spells, such as *polymorph*, and traits, such as the werewolf 's Shapechanger trait. The target immediately reverts to its true form if it is currently in a different form. This option has no effect on illusion spells, such as *disguise self*, or a creature that appears changed from the effects of an illusion, such as a hag's Illusory Appearance.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Spellsmith",
        "slug": "spellsmith",
        "desc": "Some wizards pride themselves on being spell artisans, carefully sculpting the magical energy of spells like smiths sculpt iron. Focusing on the artistry inherent in spellcasting, these wizards learn to tap the magical energy of spells and manipulate that energy to amplify or modify spells like no other arcane practitioners.\n\n##### Arcane Emendation\nBeginning when you choose this tradition at 2nd level, you can manipulate the magical energy in scrolls to change the spells written on them. While holding a scroll, you can spend 1 hour for each level of the spell focusing on the magic within the scroll to change the spell on the scroll to another spell. The new spell must be of the same school, must be on the wizard spell list, and must be of the same or lower level than the original spell. If the new spell has any material components with a cost, you must provide those when changing the scroll's original spell to the new spell, and the components are consumed as the new spell's magic overwrites the original spell on the scroll.\n\n##### Spell Transformation\nAt 2nd level, you learn to mold the latent magical energy of your spells to cast new spells. While concentrating on a wizard spell that you cast using a spell slot, you can use an action to end your concentration on that spell and use the energy to cast another wizard spell you have prepared without expending a spell slot. The new spell must be half the level (minimum of 1st) of the spell on which you were concentrating, and the new spell's casting time must be 1 action.\n  You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n\n##### Spell Honing\nAt 6th level, you can hold onto the magic of lasting spells or siphon off some of their magic to amplify spells you cast. If your concentration is broken (willingly or unwillingly), the spell's magic lingers, causing the spell's effects to remain until the end of your next turn.\n  In addition, while concentrating on a spell with a duration of concentration up to 1 minute or concentration up to 10 minutes, you can amplify a wizard spell you cast of 1st level or higher. When you amplify a spell in this way, the duration of the spell on which you are concentrating is reduced by a number of rounds (if the duration is concentration up to 1 minute) or minutes (if the duration is concentration up to 10 minutes) equal to the amplified spell's level. You can choose only one of the following options when amplifying a spell: \n* Increase the saving throw DC by 2 \n* Increase the spell attack bonus by 2 \n* Add your Intelligence modifier to one damage roll of the spell\n  You can amplify a spell this way a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n\n##### Spell Reversion\nAt 10th level, you learn to manipulate the magical energy of spells cast against you. When you must make a saving throw to end an ongoing effect, such as the frightened condition of the fear spell or the slowing effect of a copper dragon's slowing breath, you have advantage on the saving throw.\n  In addition, when an ongoing condition you successfully end on yourself was from a spell cast by a creature you can see, you can use your reaction to force that creature to make the same saving throw against your spell save DC. On a failed save, the creature suffers the effect or condition you just ended on yourself until the end of its next turn. For example, if you succeed on the saving throw to end the paralyzed condition on yourself from the hold person spell cast by a spellcaster you can see, you can force that spellcaster to make a Wisdom saving throw against your spell save DC, and that spellcaster becomes paralyzed until the end of its next turn on a failed save.\n\n##### Spell Duality\nAt 14th level, you become a master at manipulating and extending the magical energy of your longlasting spells. You can concentrate on two spells simultaneously. If you cast a third spell that requires concentration, you lose concentration on the oldest spell. When you take damage while concentrating on a spell and must make a Constitution saving throw to maintain concentration, you make one saving throw for each source of damage, as normal. You don't have to make one saving throw for each spell you are maintaining.\n  If you are concentrating on two spells and fail a Constitution saving throw to maintain concentration because of taking damage, you lose concentration on the oldest spell. If you are concentrating on two spells and lose concentration on both spells in 1 round, you suffer one level of exhaustion.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "School of Divining and Soothsaying",
        "slug": "school-of-divining-and-soothsaying",
        "desc": "Divination is said to be the oldest of the magical arts as it defends against mortals’ greatest fear: that of the unknown. Necromancy, pyromancy, geomancy, all come from *manteia*, different methods of seeing that which cannot be seen by normal means. So, whether you are reading tea leaves or interpreting charred scapula bones, your magic allows you to perceive things beyond the normal boundaries of space and time. Kings and commoners ignore your warnings only at their own periland you are an asset in any party undertaking risky endeavors, though your comrades might get sick of hearing your refrain, \"I told you so.\"\n\n##### Expert Diviner\n\nStarting at 2nd level when you choose this school, you only need to spend half as much time and gold as normal in order to copy a spell into your spellbook if the spell is from the divination school.\n\n#### Premonition\n\nAlso at 2nd level, you begin to see in your dreams brief images of events yet to unfold. After finishing a long rest, you can make two d20 rolls and keep track of the results for later. Any time before the next time you complete a long rest, when you or a creature visible to you is about to make an ability check, attack roll, or saving throw, you can choose to stop the roll from happening and instead use one of the results from your premonition.\n\nYou can only use this feature once per turn, and after you have used a result from your premonition, you cannot use it again. Any result not used before your next long rest are lost as false premonitions and cannot be used either.\n\n#### Soothing Savant\n\nStarting at 6th level, you are so skilled at soothsaying that you gain more spellcasting power when you use your divinations. Any time you use a spell slot to cast a divination spell of at least 2nd level, you regain one of your spell slots that you’ve expended for the day. A spell slot regained in this way must be lower than 6th level as well as lower than the spell level you used to activate the feature.\n\n#### Extrasensory Perception\n\nBeginning at 10th level, you can extend your senses beyond their normal capabilities. At any time, you may choose one of the following options and gain the associated benefit until you take a short or a long rest or are incapacitated. You can only use this feature once per short or long rest.\n\n***Ether Sight.*** You can see creatures and objects on the Ethereal Plane up to 60 feet away.\n\n***Script Sight.*** You can comprehend writing in any language as if it were written in your native tongue.\n\n***Shadow Sight.*** You get darkvision with a range up to 60 feet, or increase the range of your darkvision to 60 feet if you already have it.\n\n***Unseen Sight.*** You gain the power to see invisible creatures and objects as if they were visible at a range of 10 feet within your line of sight.\n\n#### Premonition Addition\n\nBeginning at 14th level, when you use your Premonition feature, you may roll and record the results of three d20s as your resting hours fill with further visions.",
        "document__slug": "o5e",
        "document__title": "Open5e Original Content",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "open5e.com"
      },
      {
        "name": "School of Illusions and Phantasms",
        "slug": "school-of-illusions-and-phantasms",
        "desc": "An illusionist calls forth phantom images and sounds from the plane of shadow to deceive the minds of the unwary. They can create the appearance of an object where none is, and they can also hide real creatures and objects from sight. They can dazzle and disorient with flashes of color, or call forth a target’s deepest inner fears. Practitioners of illusions and phantasms are often some of the most creative wizards, as every time they call upon one of their signature spells, they can make a unique experience for the situation. This school is particularly popular among gnome wizards, who have a history of relying on illusory magic to keep themselves hidden and safe from larger foes.\n\n##### Expert Illusionist\n\nStarting at 2nd level when you choose this school, you only need to spend half as much time and gold as normal in order to copy a spell into your spellbook if the spell is from the illusion school.\n\n##### Enhanced Cantrip\n\nAt 2nd level, you gain one additional cantrip, either _minor illusion_ or, if you already knew this spell, then another that you choose. Your mastery of this spell is such that, when you cast it, you can create an illusory image and a sound with the same casting. When calculating your cantrips known per level, this spell does not count against your total.\n\n##### Mutable Mirage\n\nAt 6th level, you can use your action to alter the illusion created by a spell you previously cast. You can only use this feature on spells with a duration of at least 1 minute, and you must be able to see the illusion when you alter it. You cannot change the illusion in a way not allowed by the initial casting of the spell.\n\n##### Second Semblance\n\nStarting at 10th level, if you are the target of an attack roll by another creature, you can substitute an illusion of yourself between you and your attacker. You use your reaction, causing the attack to miss you and hit the illusion, and your illusion vanishes afterwards. You can use this feature once per short or long rest.\n\n##### Phantasmagoria\n\nStarting at 14th level, you can draw energy from the plane of shadow to give parts of your illusions a temporary physical essence. Any time after you cast an illusion spell of at least 1st level, while the spell is in effect, you can use a bonus action to apply this power to a single nonmagical, inanimate object within the illusion of the spell. For 1 minute, this object can be physically interacted with, but it can’t be used to deal damage.\n\nAs an example, you could create an illusory staircase and scale it, or create an illusory portcullis to bar a pursuer, but you could not dispatch an enemy by dropping an illusory boulder on them.",
        "document__slug": "o5e",
        "document__title": "Open5e Original Content",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "open5e.com"
      },
      {
        "name": "School of Necrotic Arts",
        "slug": "school-of-necrotic-arts",
        "desc": "*Compare to the core book’s school of Necromancy*\n\nNothing fills a mundane with fear quite like a necromancer. Sure, a fireball is scary, but these masters of the dark arts deal with the forces of life and death like they were mere playthings. They can drain life from the living and force the dead to heed their beck and call. Practitioners of the necromantic arts have a reputation for evil, but they are not universally so (even if they tend to always be at least a little dark and edgy). Necromancers can also be heroic forces for good in the world, though they may need to have some flexible morals when it comes to sourcing the raw materials for their undead minions.\n\n#### Expert Necromancer\n\nStarting at 2nd level when you choose this school, you only need to spend half as much time and gold as normal in order to copy a spell into your spellbook if the spell is from the necromancy school.\n\n#### Dark Reaper\n\nAlready at 2nd level, you become adept at harvesting the animus from living beings killed by your spells. Up to once per turn, when you use a spell of 1st level or higher to kill at least one creature, you may regain lost hit points up to twice the level of the spell used. If the spell in question belongs to the necromancy school, you may instead regain hit points up to three times the level of the spell. This ability is not triggered by killing creatures without a life force, namely constructs and the undead.\n\n#### Undead Minions\n\nWhen you reach 6th level, if you do not already know the spell *animate dead*, you add it to your spell book. When you cast this spell, you may target one more pile of bones or corpse than specified by the spell’s description, creating an additional minion of the appropriate type.\n\nIn addition, any undead you create with a spell from the necromancy school gains the following benefits:\n\n* Increase the creature’s hit point maximum by a number equal to your wizard class levels.\n* When making weapon damage rolls, the creature adds your proficiency bonus to the total.\n\n#### Necrotic Acclimation\n\nAt 10th level, your familiarity with the necrotic arts has hardened you against some of their effects. You gain resistance against necrotic damage, and your hit point maximum can never be reduced.\n\n#### Control Undead\n\nBeginning at 14th level, you are able to take control of the undead, even if you did not create them with your own magic. You can use your action to target an undead creature within 60 feet of you that you can see. If the target fails a Charisma saving throw versus your wizard spell save DC, its attitude towards you becomes friendly and it obeys any commands you issue it until the next time you use this feature. If the target succeeds its saving throw, it becomes permanently immune to this effect.\n\nIf the undead creature’s Intelligence score is 8 or higher, it makes the saving throw to resist control with advantage. If its Intelligence score is 12 or higher and it fails its first saving throw, it can repeat the save to break free once every hour it remains under your control.",
        "document__slug": "o5e",
        "document__title": "Open5e Original Content",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "open5e.com"
      }
    ],
    "document__slug": "wotc-srd",
    "document__title": "5e Core Rules",
    "document__license_url": "http://open5e.com/legal",
    "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"
  }
}