{
  "slug": "a5e-ag_sage",
  "api_url": "https://api.open5e.com/v2/backgrounds/a5e-ag_sage/",
  "data": {
    "url": "https://api.open5e.com/v2/backgrounds/a5e-ag_sage/",
    "key": "a5e-ag_sage",
    "benefits": [
      {
        "name": "Ability Score Increases",
        "desc": "+1 to Intelligence and one other ability score.",
        "type": "ability_score"
      },
      {
        "name": "Adventures And Advancement",
        "desc": "When you visit libraries and universities you tend to be asked for help in your role as a comparatively rough-and-tumble adventurer. After fetching a few bits of esoteric knowledge and settling a few academic disputes, you may be granted access to the restricted areas of the library (which contain darker secrets and deeper mysteries, such as those answerable with a DC 25 Arcana, Culture, Engineering, History, Nature, or Religion check).",
        "type": "adventures_and_advancement"
      },
      {
        "name": "Connection and Memento",
        "desc": "Roll 1d10, choose, or make up your own.\r\n\r\n### Sage Connections\r\n\r\n1. Your rival who always seems to be one step ahead of you in the research race.\r\n2. The college dean who banished you for conduct unbefitting a research fellow.\r\n3. A former student of yours who has become a dangerous wizard.\r\n4. The professor who took credit for your research.\r\n5. The rival sage whose cruel nickname for you has made you a laughingstock.\r\n6. The alchemist who will pay for bizarre monster trophies and other ingredients—no questions asked.\r\n7. The peer with a competing cosmological theory that causes endless friendly bickering.\r\n8. The noble who recognized your intelligence at a young age and sponsored your entrance into academia.\r\n9. A talented apprentice who ran away after mastering magical power but not the theoretical foundation to control it.\r\n10. The invading general who burned the library that was once your home.\r\n\r\n### Sage Mementos\r\n\r\n1. A letter from a colleague asking for research help.\r\n2. Your incomplete manuscript.\r\n3. An ancient scroll in a language that no magic can decipher.\r\n4. A copy of your highly unorthodox theoretical work that got you in so much trouble.\r\n5. A list of the forbidden books that may answer your equally forbidden question.\r\n6. A formula for a legendary magic item for which you have no ingredients.\r\n7. An ancient manuscript of a famous literary work believed to have been lost; only you believe that it is genuine.\r\n8. Your mentor's incomplete bestiary, encyclopedia, or other work that you vowed to complete.\r\n9. Your prize possession: a magic quill pen that takes dictation.\r\n10. The name of a book you need for your research that seems to be missing from every library you've visited.",
        "type": "connection_and_memento"
      },
      {
        "name": "Equipment",
        "desc": "Bottle of ink, pen, 50 sheets of parchment, common clothes.",
        "type": "equipment"
      },
      {
        "name": "Library Privileges",
        "desc": "As a fellow or friend of several universities you have visiting access to the great libraries, most of which are off-limits to the general public. With enough time spent in a library, you can uncover most of the answers you seek (any question answerable with a DC 20 Arcana, Culture, Engineering, History, Nature, or Religion check).",
        "type": "feature"
      },
      {
        "name": "Skill Proficiencies",
        "desc": "History, and either Arcana, Culture, Engineering, or Religion.",
        "type": "skill_proficiency"
      }
    ],
    "document": {
      "name": "Adventurer's Guide",
      "key": "a5e-ag",
      "display_name": "Adventurer's Guide",
      "publisher": {
        "name": "EN Publishing",
        "key": "en-publishing",
        "url": "https://api.open5e.com/v2/publishers/en-publishing/"
      },
      "gamesystem": {
        "name": "Advanced 5th Edition",
        "key": "a5e",
        "url": "https://api.open5e.com/v2/gamesystems/a5e/"
      },
      "permalink": "https://a5esrd.com/a5esrd"
    },
    "name": "Sage",
    "desc": ""
  }
}