{
  "slug": "a5e-ag_soldier",
  "api_url": "https://api.open5e.com/v2/backgrounds/a5e-ag_soldier/",
  "data": {
    "url": "https://api.open5e.com/v2/backgrounds/a5e-ag_soldier/",
    "key": "a5e-ag_soldier",
    "benefits": [
      {
        "name": "Ability Score Increases",
        "desc": "+1 to Strength and one other ability score.",
        "type": "ability_score"
      },
      {
        "name": "Adventures and Advancement",
        "desc": "You will occasionally run into old comrades, some of whom may need favors. If you perform a few celebrated martial deeds your old military outfit (or a new one) is likely to offer you an officer’s rank. You gain the free service of up to 8 guards. Your new commanders will occasionally give you objectives: you will be expected to act independently in order to achieve these objectives.",
        "type": "adventures_and_advancement"
      },
      {
        "name": "Connection and Memento",
        "desc": "Roll 1d10, choose, or make up your own.\r\n\r\n### Soldier Connections\r\n1. Your old commanding officer who still wants you to rejoin.\r\n2. The commander who callously sent your unit into a slaughter.\r\n3. Your shady war buddy who can get their hands on anything with no questions asked.\r\n4. Your best friend who went missing on the battlefield. \r\n5. The comrade who saved your life at the risk of their own.\r\n6. The ghost who haunts you. \r\n7. The superior officer you punched (for abusing civilians? For insulting your honor? For preventing you from looting?)\r\n8. The scary experimental war construct you accompanied on a dangerous mission.\r\n9. The golden-armored knight with ridiculously good teeth who was always giving inspiring speeches.\r\n10. The enemy officer who captured you.\r\n\r\n### Soldier Mementos\r\n1. A broken horn, tooth, or other trophy salvaged from a monster’s corpse.\r\n2. A trophy won in a battle (a tattered banner, a ceremonial sword, or similar).\r\n3. A gaming set.\r\n4. A letter from your sweetheart.\r\n5. An old wound that twinges in bad weather.\r\n6. A letter you’re supposed to deliver to a dead comrade’s family.\r\n7. A horrifying memory you can’t escape.\r\n8. A horned or plumed helmet.\r\n9. The sword you broke over your knee rather than fight for those bastards another day.\r\n10. A medal for valor.",
        "type": "connection_and_memento"
      },
      {
        "name": "Languages",
        "desc": "One of your choice.",
        "type": "language"
      },
      {
        "name": "Military Bearing",
        "desc": "Soldiers recognize their own. Off duty soldiers are usually willing to trade tales and gossip with you. On duty soldiers, while not obeying your orders, are likely to answer your questions and treat you respectfully on the off chance that you’re an unfamiliar officer who can get them in trouble.",
        "type": "feature"
      },
      {
        "name": "Skill Proficiencies",
        "desc": "Athletics, and either Animal Handling or Intimidation.",
        "type": "skill_proficiency"
      },
      {
        "name": "Suggested Equipment",
        "desc": "Uniform, common clothes, 7 days rations.",
        "type": "equipment"
      },
      {
        "name": "Tool Proficiencies",
        "desc": "One type of gaming set.",
        "type": "tool_proficiency"
      }
    ],
    "document": {
      "name": "Adventurer's Guide",
      "key": "a5e-ag",
      "display_name": "Adventurer's Guide",
      "publisher": {
        "name": "EN Publishing",
        "key": "en-publishing",
        "url": "https://api.open5e.com/v2/publishers/en-publishing/"
      },
      "gamesystem": {
        "name": "Advanced 5th Edition",
        "key": "a5e",
        "url": "https://api.open5e.com/v2/gamesystems/a5e/"
      },
      "permalink": "https://a5esrd.com/a5esrd"
    },
    "name": "Soldier",
    "desc": ""
  }
}