{
  "slug": "cleric",
  "api_url": "https://api.open5e.com/v1/classes/cleric/",
  "data": {
    "name": "Cleric",
    "slug": "cleric",
    "desc": "### Spellcasting \n \nAs a conduit for divine power, you can cast cleric spells. \n \n#### Cantrips \n \nAt 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table. \n \n#### Preparing and Casting Spells \n \nThe Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nYou prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots. \n \nFor example, if you are a 3rd-level cleric, you have four \n1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell *cure wounds*, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. \n \nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. \n \n#### Spellcasting Ability \n \nWisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier \n \n**Spell attack modifier** = your proficiency bonus + your Wisdom modifier \n \n#### Ritual Casting \n \nYou can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared. \n \n#### Spellcasting Focus \n \nYou can use a holy symbol (see chapter 5, “Equipment”) as a spellcasting focus for your cleric spells. \n \n### Divine Domain \n \nChoose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed at the end of the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels. \n \n#### Domain Spells \n \nEach domain has a list of spells-its domain spells- that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. \n \nIf you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you. \n \n### Channel Divinity \n \nAt 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description. \n \nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. \n \nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC. \n \nBeginning at 6th level, you can use your Channel \n \nDivinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses. \n \n#### Channel Divinity: Turn Undead \n \nAs an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. \n \nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Destroy Undead \n \nStarting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table. \n \n**Destroy Undead (table)** \n \n| Cleric Level | Destroys Undead of CR... | \n|--------------|--------------------------| \n| 5th          | 1/2 or lower             | \n| 8th          | 1 or lower               | \n| 11th         | 2 or lower               | \n| 14th         | 3 or lower               | \n| 17th         | 4 or lower               | \n \n### Divine Intervention \n \nBeginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. \n \nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The GM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. \n \nIf your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest. \n \nAt 20th level, your call for intervention succeeds automatically, no roll required.",
    "hit_dice": "1d8",
    "hp_at_1st_level": "8 + your Constitution modifier",
    "hp_at_higher_levels": "1d8 (or 5) + your Constitution modifier per cleric level after 1st",
    "prof_armor": "Light armor, medium armor, shields",
    "prof_weapons": "Simple weapons",
    "prof_tools": "None",
    "prof_saving_throws": "Wisdom, Charisma",
    "prof_skills": "Choose two from History, Insight, Medicine, Persuasion, and Religion",
    "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n \n* (*a*) a mace or (*b*) a warhammer (if proficient) \n* (*a*) scale mail, (*b*) leather armor, or (*c*) chain mail (if proficient) \n* (*a*) a light crossbow and 20 bolts or (*b*) any simple weapon \n* (*a*) a priest's pack or (*b*) an explorer's pack \n* A shield and a holy symbol",
    "table": "| Level | Proficiency Bonus | Features                                                                | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th | \n|-------|-------------------|-------------------------------------------------------------------------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----| \n| 1st   | +2                | Spellcasting, Divine Domain                                             | 3              | 2   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 2nd   | +2                | Channel Divinity (1/rest), Divine Domain Feature                        | 3              | 3   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 3rd   | +2                | -                                                                       | 3              | 4   | 2   | -   | -   | -   | -   | -   | -   | -   | \n| 4th   | +2                | Ability Score Improvement                                               | 4              | 4   | 3   | -   | -   | -   | -   | -   | -   | -   | \n| 5th   | +3                | Destroy Undead (CR 1/2)                                                 | 4              | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   | \n| 6th   | +3                | Channel Divinity (2/rest), Divine Domain Feature                        | 4              | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   | \n| 7th   | +3                | -                                                                       | 4              | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   | \n| 8th   | +3                | Ability Score Improvement, Destroy Undead (CR 1), Divine Domain Feature | 4              | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   | \n| 9th   | +4                | -                                                                       | 4              | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   | \n| 10th  | +4                | Divine Intervention                                                     | 5              | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   | \n| 11th  | +4                | Destroy Undead (CR 2)                                                   | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 12th  | +4                | Ability Score Improvement                                               | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 13th  | +5                | -                                                                       | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 14th  | +5                | Destroy Undead (CR 3)                                                   | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 15th  | +5                | -                                                                       | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 16th  | +5                | Ability Score Improvement                                               | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 17th  | +6                | Destroy Undead (CR 4), Divine Domain Feature                            | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   | \n| 18th  | +6                | Channel Divinity (3/rest)                                               | 5              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   | \n| 19th  | +6                | Ability Score Improvement                                               | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | \n| 20th  | +6                | Divine Intervention improvement                                         | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
    "spellcasting_ability": "Wisdom",
    "subtypes_name": "Divine Domains",
    "archetypes": [
      {
        "name": "Life Domain",
        "slug": "life-domain",
        "desc": "The Life domain focuses on the vibrant positive energy-one of the fundamental forces of the universe-that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei). \n \n**Life Domain Spells (table)** \n \n| Cleric Level | Spells                               | \n|--------------|--------------------------------------| \n| 1st          | bless, cure wounds                   | \n| 3rd          | lesser restoration, spiritual weapon | \n| 5th          | beacon of hope, revivify             | \n| 7th          | death ward, guardian of faith        | \n| 9th          | mass cure wounds, raise dead         | \n \n##### Bonus Proficiency \n \nWhen you choose this domain at 1st level, you gain proficiency with heavy armor. \n \n##### Disciple of Life \n \nAlso starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level. \n \n##### Channel Divinity: Preserve Life \n \nStarting at 2nd level, you can use your Channel Divinity to heal the badly injured. \n \nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct. \n \n##### Blessed Healer \n \nBeginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level. \n \n##### Divine Strike \n \nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Supreme Healing \n \nStarting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"
      },
      {
        "name": "Blood Domain",
        "slug": "blood-domain",
        "desc": "The Blood domain centers around the understanding of the natural life force within one’s own physical body. The power of blood is the power of sacrifice, the balance of life and death, and the spirit’s anchor within the mortal shell. The Gods of Blood seek to tap into the connection between body and soul through divine means, exploit the hidden reserves of will within one’s own vitality, and even manipulate or corrupt the body of others through these secret rites of crimson. Almost any neutral or evil deity can claim some influence over the secrets of blood magic and this domain, while the gods who watch from more moral realms shun its use beyond extenuating circumstance./n When casting divine spells as a Blood Domain cleric, consider ways to occasionally flavor your descriptions to tailor the magic’s effect on the opponent’s blood and vitality. Hold person might involve locking a target’s body into place from the blood stream out, preventing them from moving. Cure wounds may feature the controlling of blood like a needle and thread to close lacerations. Guardian of faith could be a floating, crimson spirit of dripping viscera who watches the vicinity with burning red eyes. Have fun with the themes!\n\n **Blood Domain Spells**\n | Cleric Level | Spells                                | \n |--------------|-------------------------------------------| \n | 1st          | *sleep*, *ray of sickness*                | \n | 3rd          | *ray of enfeeblement*, *crown of madness* | \n | 5th          | *haste*, *slow*                           | \n | 7th          | *blight*, *stoneskin*                     | \n | 9th          | *dominate person*, *hold monster*         |\n\n ##### Bonus Proficiencies\nAt 1st Level, you gain proficiency with martial weapons.\n\n ##### Bloodletting Focus\nFrom 1st level, your divine magics draw the blood from inflicted wounds, worsening the agony of your nearby foes. When you use a spell of 1st level or higher to damage to any creatures that have blood, those creatures suffer additional necrotic damage equal to 2 + the spell’s level.\n\n ##### Channel Divinity: Blood Puppet\nStarting at 2nd level, you can use your Channel Divinity to briefly control a creature’s actions against their will. As an action, you target a Large or smaller creature that has blood within 60 feet of you. That creature must succeed on a Constitution saving throw against your spell save DC or immediately move up to half of their movement in any direction of your choice and make a single weapon attack against a creature of your choice within range. Dead or unconscious creatures automatically fail their saving throw. At 8th level, you can target a Huge or smaller creature.\n\n ##### Channel Divinity: Crimson Bond\nStarting at 6th level, you can use your Channel Divinity to focus on a sample of blood from a creature that is at least 2 ounces, and that has been spilt no longer than a week ago. As an action, you can focus on the blood of the creature to form a bond and gain information about their current circumstances. You know their approximate distance and direction from you, as well as their general state of health, as long as they are within 10 miles of you. You can maintain Concentration on this bond for up to 1 hour.\nDuring your bond, you can spend an action to attempt to connect with the bonded creature’s senses. The target makes a Constitution saving throw against your spell save DC. If they succeed, the connection is resisted, ending the bond. You suffer 2d6 necrotic damage. Upon a failed saving throw, you can choose to either see through the eyes of or hear through their ears of the target for a number of rounds equal to your Wisdom modifier (minimum of 1). During this time, you are blind or deaf (respectively) with regard to your own senses. Once this connection ends, the Crimson Bond is lost.\n\n **Health State Examples**\n | 100%    | Untouched            | \n | 99%-50% | Injured              | \n | 49%-1%  | Heavily Wounded      | \n | 0%      | Unconscious or Dying | \n | –       | Dead                 |\n\n ##### Sanguine Recall\nAt 8th level, you can sacrifice a portion of your own vitality to recover expended spell slots. As an action, you recover spell slots that have a combined level equal to or less than half of your cleric level (rounded up), and none of the slots can be 6th level or higher. You immediately suffer 1d6 damage per spell slot level recovered. You can’t use this feature again until you finish a long rest.\nFor example, if you’re a 4th-level Cleric, you can recover up to two levels of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots. You then suffer 2d6 damage.\n\n ##### Vascular Corruption Aura\nAt 17th level, you can emit a powerful aura as an action that extends 30 feet out from you that pulses necrotic energy through the veins of nearby foes, causing them to burst and bleed. For 1 minute, any enemy creatures with blood that begin their turn within the aura or enter it for the first time on their turn immediately suffer 2d6 necrotic damage. Any enemy creature with blood that would regain hit points while within the aura only regains half of the intended number of hit points (rounded up).\nOnce you use this feature, you can’t use it again until you finish a long rest.",
        "document__slug": "taldorei",
        "document__title": "Critical Role: Tal’Dorei Campaign Setting",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://https://greenronin.com/blog/2017/09/25/ronin-round-table-integrating-wizards-5e-adventures-with-the-taldorei-campaign-setting/"
      },
      {
        "name": "Hunt Domain",
        "slug": "hunt-domain",
        "desc": "Many terrible creatures prey on the villages, towns, and inns that dot the forests of Midgard. When such creatures become particularly aggressive or can't be dissuaded by local druids, the settlements often call on servants of gods of the hunt to solve the problem.\n  Deities devoted to hunting value champions who aid skillful hunters or who lead hunts themselves. Similarly, deities focused on protecting outlier settlements or who promote strengthening small communities also value such clerics. While these clerics might not have the utmost capability for tracking and killing prey, their gods grant them blessings to ensure successful hunts. These clerics might use their abilities to ensure their friends and communities have sufficient food to survive difficult times, or they might enjoy the sport of pursuing and slaying intelligent prey.\n\n**Hunt Domain Spells**\n| Cleric Level | Spells                                 | \n|--------------|----------------------------------------| \n| 1st          | *bloodbound*, *illuminate spoor*       | \n| 3rd          | *instant snare*, *mark prey*           | \n| 5th          | *going in circles*, *tracer*           | \n| 7th          | *heart-seeking arrow*, *hunting stand* | \n| 9th          | *harrying hounds*, *maim*              |\n\n##### Blessing of the Hunter\nAt 1st level, you gain proficiency in Survival. You can use your action to touch a willing creature other than yourself to give it advantage on Wisdom (Survival) checks. This blessing lasts for 1 hour or until you use this feature again.\n\n##### Bonus Proficiency\nAt 1st level, you gain proficiency with martial weapons.\n\n##### Channel Divinity: Heart Strike\nStarting at 2nd level, you can use your Channel Divinity to inflict grievous wounds. When you hit a creature with a weapon attack, you can use your Channel Divinity to add +5 to the attack's damage. If you score a critical hit with the attack, add +10 to the attack's damage instead.\n\n##### Pack Hunter\nStarting at 6th level, when an ally within 30 feet of you makes a weapon attack roll against a creature you attacked within this round, you can use your reaction to grant that ally advantage on the attack roll.\n\n##### Divine Strike\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Deadly Stalker\nAt 17th level, you can use an action to describe or name a creature that is familiar to you or that you can see within 120 feet. For 24 hours or until the target is dead, whichever occurs first, you have advantage on Wisdom (Survival) checks to track your target and Wisdom (Perception) checks to detect your target. In addition, you have advantage on weapon attack rolls against the target. You can't use this feature again until you finish a short or long rest.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Mercy Domain",
        "slug": "mercy-domain",
        "desc": "Mercy can mean promoting healing instead of harm, but it can also mean ending suffering with a quick death. These often-contradictory ideals are the two sides of mercy. The tenets of deities who embody mercy promote ways to end bloody conflicts or deliver healing magics to those in need. While mercy for some may be benevolent, for others it is decidedly not so. More pragmatic mercy gods teach the best method to relieve the agony and torment brought on by monsters and the forces of evil is to bring about the end of that evil.\n **Mercy Domain Spells (table)**\n| Cleric Level | Spells                              | \n|--------------|-------------------------------------| \n| 1st          | *divine favor*, *healing word*      | \n| 3rd          | *aid*, *ray of enfeeblement*        | \n| 5th          | *bardo*, *revivify*                 | \n| 7th          | *death ward*, *sacrificial healing* | \n| 9th          | *antilife shell*, *raise dead*      |\n\n##### Bonus Proficiencies\nWhen you choose this domain at 1st level, you take your place on the line between the two aspects of mercy: healing and killing. You gain proficiency in the Medicine skill and with the poisoner's kit. In addition, you gain proficiency with heavy armor and martial weapons.\n\n##### Threshold Guardian\nAlso at 1st level, when you hit a creature that doesn't have all of its hit points with a melee weapon attack, the weapon deals extra radiant or necrotic damage (your choice) equal to half your proficiency bonus.\n\n##### Channel Divinity: Involuntary Aid\nStarting at 2nd level, you can use your Channel Divinity to wrest the lifeforce from an injured creature and use it to heal allies. As an action, you present your holy symbol to one creature you can see within 30 feet of you that doesn't have all of its hit points. The target must make a Wisdom saving throw, taking radiant or necrotic damage (your choice) equal to three times your cleric level on a failed save, or half as much damage on a successful one. Then, one friendly creature you can see within 30 feet of you regains a number of hit points equal to the amount of damage dealt to the target.\n\n##### Bolster the Living\nAt 6th level, you gain the ability to manipulate a portion of the lifeforce that escapes a creature as it perishes. When a creature you can see dies within 30 feet of you, you can use your reaction to channel a portion of that energy into a friendly creature you can see within 30 feet of you. The friendly creature gains a bonus to attack and damage rolls equal to half your proficiency bonus until the end of its next turn.\n\n##### Divine Strike of Mercy\nAt 8th level, you gain the ability to infuse your weapon strikes with the dual nature of mercy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d6 radiant or necrotic damage (your choice) to the target. If the target dies from this attack, a friendly creature you can see within 5 feet of you regains hit points equal to half the damage dealt. If no friendly creature is within 5 feet of you, you regain the hit points instead. When you reach 14th level, the extra damage increases to 2d6.\n\n##### Hand of Grace and Execution\nAt 17th level, you imbue the two sides of mercy into your spellcasting. Once on each of your turns, if you cast a spell that restores hit points to one creature or deals damage to one creature, you can add your proficiency bonus to the amount of hit points restored or damage dealt.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Portal Domain",
        "slug": "portal-domain",
        "desc": "You have dedicated yourself to the study and protection of the doors, gateways, and rips in the boundaries between the physical world and the infinite planar multiverse. Stepping through portals is a sacred prayer and woe betide any who seek to misuse them. Domain Spells You gain domain spells at the cleric levels listed in the Portal Domain Spells table. See the Divine Domain class feature for how domain spells work.\n\n**Portal Domain Spells**\n| Cleric Level | Spells                                    | \n|--------------|-------------------------------------------| \n| 1st          | *adjust position*, *expeditious retreat*  | \n| 3rd          | *glyph of shifting*, *misty step*         | \n| 5th          | *dimensional shove*, *portal jaunt*       | \n| 7th          | *dimension door*, *reposition*            | \n| 9th          | *pierce the veil*, *teleportation circle* |\n\n##### Bonus Proficiencies\nWhen you choose this domain at 1st level, you gain proficiency with heavy armor and either cartographer's tools or navigator's tools (your choice). In addition, you gain proficiency in the Arcana skill.\n\n##### Portal Magic\nStarting at 1st level, you gain access to spells that connect places or manipulate the space between places. Each spell with “(liminal)” listed alongside its school is a cleric spell for you, even if it doesn't appear on the cleric spell list, and you can prepare it as you would any other spell on the cleric spell list. Liminal spells include *bardo*, *devouring darkness*, *door of the far traveler*, *ethereal stairs*, *hypnagogia*, *hypnic jerk*, *mind maze*, *mirror realm*, *pierce the veil*, *reciprocating portal*, *rive*, *subliminal aversion*, and *threshold slip*. See the Magic and Spells chapter for details on these spells.\n\n##### Portal Bond\nAt 1st level, you learn to forge a bond between yourself and another creature. At the end of a short or long rest, you can touch one willing creature, establishing a magical bond between you. While bonded to a creature, you know the direction to the creature, though not its exact location, as long as you are both on the same plane of existence. As an action, you can teleport the bonded creature to an unoccupied space within 5 feet of you or to the nearest unoccupied space, provided the bonded creature is willing and within a number of miles of you equal to your proficiency bonus. Alternatively, you can teleport yourself to an unoccupied space within 5 feet of the bonded creature.\n  Once you teleport a creature in this way, you can't use this feature again until you finish a long rest. You can have only one bonded creature at a time. If you bond yourself to a new creature, the bond on the previous creature ends. Otherwise, the bond lasts until you die or dismiss it as an action.\n\n##### Channel Divinity: Dimensional Shift\nStarting at 2nd level, you can use your Channel Divinity to harness the magic of portals and teleportation. As an action, you teleport a willing target you can see, other than yourself, to an unoccupied space within 30 feet of you that you can see. When you reach 10th level in this class, you can teleport an unwilling target. An unwilling target that succeeds on a Wisdom saving throw is unaffected.\n\n##### Portal Touch\nAt 6th level, you can use a bonus action to create a small portal in a space you can see within 30 feet of you. This portal lasts for 1 minute, and it doesn't occupy the space where you create it. When you cast a spell with a range of touch, you can touch any creature within your reach or within 5 feet of the portal. While the portal is active, you can use a bonus action on each of your turns to move the portal up to 30 feet. The portal must remain within 30 feet of you. If you or the portal are ever more than 30 feet apart, the portal fades. You can have only one portal active at a time. If you create another one, the previous portal fades.\n  You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n\n##### Transpositional Divine Strike\nAt 8th level, you gain the ability to imbue your weapon strikes with portal magic. Once on each of your turns when you hit a creature with a weapon attack, you deal damage to the target as normal, and you open a brief portal next to your target or another creature you can see within 30 feet of you. That creature takes 1d8 damage of your weapon's type as a duplicate of your weapon lashes out at the creature from the portal. When you reach 14th level, you can choose two creatures, creating a portal next to each and dealing 1d8 damage of your weapon's type to each. Alternatively, you can choose one creature and deal 2d8 damage to it.\n\n##### Portal Mastery\nAt 17th level, when you see a creature use a magical gateway, teleport, or cast a spell that would teleport itself or another creature, you can use your reaction to reroute the effect, changing the destination to be an unoccupied space of your choice that you can see within 100 feet of you. Once you use this feature, you can't use it again until you finish a long rest, unless you expend a spell slot of 5th level or higher to use this feature again.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Serpent Domain",
        "slug": "serpent-domain",
        "desc": "You embody the deadly, secretive, and mesmerizing nature of serpents. Others tremble at your majesty. You practice the stealth and envenomed attacks that give serpents their dreaded reputation, but you also learn the shedding of skin that has made snakes into symbols of medicine.\n\n**Serpent Domain Spells**\n| Cleric Level | Spells                                              | \n|--------------|-----------------------------------------------------| \n| 1st          | *charm person*, *find familiar* (snakes only)       | \n| 3rd          | *enthrall*, *protection from poison*                | \n| 5th          | *conjure animals* (snakes only), *hypnotic pattern* | \n| 7th          | *freedom of movement*, *polymorph* (snakes only)    | \n| 9th          | *dominate person*, *mislead*                        |\n\n##### Envenomed\nWhen you choose this domain at 1st level, you learn the *poison spray* cantrip. In addition, you gain proficiency in the Deception skill, with a poisoner's kit, and with martial weapons that have the Finesse property. You can apply poison to a melee weapon or three pieces of ammunition as a bonus action.\n\n##### Ophidian Tongue\nAlso at 1st level, you can communicate telepathically with serpents, snakes, and reptiles within 100 feet of you. A creature's responses, if any, are limited by its intelligence and typically convey the creature's current or most recent state, such as “hungry” or “in danger.”\n\n##### Channel Divinity: Serpent Stealth\nBeginning at 2nd level, you can use your Channel Divinity to help your allies move undetected. As an action, choose up to five creatures you can see within 30 feet of you. You and each target have advantage on Dexterity (Stealth) checks for 10 minutes.\n\n##### Serpent's Blood\nStarting at 6th level, you are immune to the poisoned condition and have resistance to poison damage.\n\n##### Divine Strike\nBeginning at 8th level, you can infuse your weapon strikes with venom. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Transformative Molt\nBeginning at 17th level, as part of a short or long rest, you can assume a new form, your old skin crumbling to dust. You decide what your new form looks like, including height, weight, facial features, vocal tone, coloration, and distinguishing characteristics, if any. This feature works like the Change Appearance aspect of the *alter self* spell, except it lasts until you finish a short or long rest.\n  In addition, when you are reduced to less than half your hit point maximum, you can end this transformation as a reaction to regain hit points equal to 3 times your cleric level. Once you end the transformation in this way, you can't use this feature to change your appearance again until you finish a long rest.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Shadow Domain",
        "slug": "shadow-domain",
        "desc": "The shadow domain embraces the darkness that surrounds all things and manipulates the transitory gray that separates light from dark. Shadow domain clerics walk a subtle path, frequently changing allegiances and preferring to operate unseen.\n\n**Shadow Domain Spells**\n| Cleric Level | Spells                                    | \n|--------------|-------------------------------------------| \n| 1st          | *bane*, *false life*                      | \n| 3rd          | *blindness/deafness*, *darkness*          | \n| 5th          | *blink*, *fear*                           | \n| 7th          | *black tentacles*, *greater invisibility* | \n| 9th          | *cone of cold*, *dream*                   |\n\n##### Cover of Night\nWhen you choose this domain at 1st level, you gain proficiency in the Stealth skill and darkvision out to a range of 60 feet. If you already have darkvision, its range increases by 30 feet. In addition, when you are in dim light or darkness, you can use a bonus action to Hide.\n\n##### Lengthen Shadow\nStarting at 1st level, you can manipulate your own shadow to extend your reach. When you cast a cleric spell with a range of touch, your shadow can deliver the spell as if you had cast the spell. Your target must be within 15 feet of you, and you must be able to see the target. You can use this feature even if you are in an area where you cast no shadow.\n  When you reach 10th level in this class, your shadow can affect any target you can see within 30 feet of you.\n\n##### Channel Divinity: Shadow Grasp\nStarting at 2nd level, you can use your Channel Divinity to turn a creature's shadow against them. As an action, choose one creature that you can see within 30 feet of you. That creature must make a Strength saving throw. If the creature fails the saving throw, it is restrained by its shadow until the end of your next turn. If the creature succeeds, it is grappled by its shadow until the end of your next turn. You can use this feature even if the target is in an area where it casts no shadow.\n\n##### Fade to Black\nAt 6th level, you can conceal yourself in shadow. As a bonus action when you are in dim light or darkness, you can magically become invisible for 1 minute. This effect ends early if you attack or cast a spell. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n\n##### Potent Spellcasting\nStarting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.\n\n##### Army of Shadow\nAt 17th level, you can manipulate multiple shadows simultaneously. When you use Shadow Grasp, you can affect a number of creatures equal to your proficiency bonus.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Vermin Domain",
        "slug": "vermin-domain",
        "desc": "You exemplify the cunning, stealth, and invasiveness of vermin (rodents, scorpions, spiders, ants, and other insects). As your dedication to this domain grows in strength, you realize a simple truth: vermin are everywhere, and you are legion.\n\n**Vermin Domain Spells**\n| Cleric Level | Spells  | \n|--------------|---------| \n| 1st          | *detect poison and disease*, *speak with animals* (vermin only)  | \n| 3rd          | *spider climb*, *web*  | \n| 5th          | *conjure animals* (vermin only), *fear*  | \n| 7th          | *dominate beast* (vermin only), *giant insect*  | \n| 9th          | *contagion*, *insect plague*  |\n\n##### The Unseen\nWhen you choose this domain at 1st level, you gain proficiency with shortswords and hand crossbows. You also gain proficiency in Stealth and Survival. You can communicate simple ideas telepathically with vermin, such as mice, spiders, and ants, within 100 feet of you. A vermin's responses, if any, are limited by its intelligence and typically convey the creature's current or most recent state, such as “hungry” or “in danger.”\n\n##### Channel Divinity: Swarm Step\nStarting at 2nd level, you can use your Channel Divinity to evade attackers. As a bonus action, or as reaction when you are attacked, you transform into a swarm of vermin and move up to 30 feet to an unoccupied space that you can see. This movement doesn't provoke opportunity attacks. When you arrive at your destination, you revert to your normal form.\n\n##### Legion of Bites\nAt 6th level, you can send hundreds of spectral vermin to assail an enemy and aid your allies. As an action, choose a creature you can see within 30 feet of you. That creature must succeed on a Constitution saving throw against your spell save DC or be covered in spectral vermin for 1 minute. Each time one of your allies hits the target with a weapon attack, the target takes an extra 1d4 poison damage. A creature that is immune to disease is immune to this feature.\n  You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a long rest.\n\n##### Divine Strike\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Verminform Blessing\nAt 17th level, you become a natural lycanthrope. You use the statistics of a wererat, though your form can take on insectoid aspects, such as mandibles, compound eyes, or antennae, instead of rat aspects; whichever aspects are most appropriate for your deity. Your alignment doesn't change as a result of this lycanthropy, and you can't spread the disease of lycanthropy.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Wind Domain",
        "slug": "wind-domain",
        "desc": "You have dedicated yourself to the service of the primordial winds. In their service, you are the gentle zephyr brushing away adversity or the vengeful storm scouring the stones from the mountainside.\n\n**Wind Domain Spells**\n| Cleric Level | Spells                                                        | \n|--------------|---------------------------------------------------------------| \n| 1st          | *feather fall*, *thunderwave*                                 | \n| 3rd          | *gust of wind*, *misty step*                                  | \n| 5th          | *fly*, *wind wall*                                            | \n| 7th          | *conjure minor elementals* (air only), *freedom of movement*  | \n| 9th          | *cloudkill*, *conjure elemental* (air only)                   |\n\n##### Wind's Chosen\nWhen you choose this domain at 1st level, you learn the *mage hand* cantrip and gain proficiency in the Nature skill. When you cast *mage hand*, you can make the hand invisible, and you can control the hand as a bonus action.\n\n##### Channel Divinity: Grasp Not the Wind\nAt 2nd level, you can use your Channel Divinity to end the grappled condition on yourself and gain a flying speed equal to your walking speed until the end of your turn. You don't provoke opportunity attacks while flying in this way.\n\n##### Stormshield\nAt 6th level, when you take lightning or thunder damage, you can use your reaction to gain resistance to lightning and thunder damage, including against the triggering attack, until the start of your next turn. You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a long rest.\n\n##### Divine Strike\nAt 8th level, you infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Dire Tempest\nAt 17th level, you can create a 20-foot-radius tornado of swirling wind and debris at a point you can see within 120 feet. The storm lasts until the start of your next turn. All Huge or smaller creatures within the area must make a Strength saving throw against your spell save DC. On a failure, a creature takes 8d6 bludgeoning damage and is thrown 1d4 *x* 10 feet into the air. On a success, a creature takes half the damage and isn't thrown into the air. Creatures thrown into the air take falling damage as normal and land prone.\n  In addition, each creature that starts its turn within 15 feet of the tornado must succeed on a Strength saving throw against your spell save DC or be dragged into the tornado's area. A creature that enters the tornado's area is thrown 1d4 *x* 10 feet into the air, taking falling damage as normal and landing prone.\nOnce you use this feature, you can't use it again until you finish a long rest.",
        "document__slug": "toh",
        "document__title": "Tome of Heroes",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "https://koboldpress.com/kpstore/product/tome-of-heroes-for-5th-edition/"
      },
      {
        "name": "Demise Domain",
        "slug": "demise-domain",
        "desc": "*Compare to the core book’s Death Domain*\n\nWhile deities oversee all realms of nature and the cosmos, perhaps none is more important to mortals than their purveyance over the afterlife. The demise domain covers both gods who rule over kingdoms of the dead, such as Arawn, Ereshkigal, Mictlāntēcutli, Hades, Hel, and Osiris; it is also held by deities who oversee conflict and the actual moment of one’s demise, for instance the Morrigan and Nergal, and deities of suffering (Kiputytto) and disease (Loviatar). It includes many winter deities like Hel and Marzanna that oversee the metaphorical death of spring, and patrons of the undead like Koschei the Deathless are also served by clerics of the demise domain. The domain is often favored by evil deities like Erlik, but is not exclusive to them; noble judges of souls like Anubis and helpful psychopomps like Xolotl also have the demise domain in their portfolio. Similarly, while the demise domain is often favored by evil cultists, clerics who seek to comfort the dying or uphold the natural progression of the afterlife may also select this domain.\n\nNote: this subclass is primarily for NPCs, but a player can choose it at their Game Master’s discretion.\n\n**Demise Domain Spells (table)**\n\n| Cleric Level | Spells                                  |\n|--------------|-----------------------------------------|\n| 1st          | false life, ray of sickness             |\n| 3rd          | blindness/deafness, ray of enfeeblement |\n| 5th          | animate dead, vampiric touch            |\n| 7th          | blight, death ward                      |\n| 9th          | antilife shell, cloudkill               |\n\n##### Bonus Proficiency\n\nWhen you choose this domain at 1st level, you gain the martial weapon proficiency.\n\n#### Death’s Cut\n\nYour connection to death means that your necromantic powers can cut through more foes. You learn an additional cantrip of the necromancy school from any class spell list. When you cast any necromancy cantrip that targets a single creature, you can target a second creature within the spell’s range if it is within 5 feet of the first target.\n\n#### Channel Divinity: Killing Touch\n\nBeginning at 2nd level, when one of your melee attacks hit a creature, you can make use of your Channel Divinity to add necrotic damage equal to your cleric level times two, plus 5.\n\n#### Death Comes for All\n\nJust as death comes for all creatures, at 6th level your deathly powers affect even those who could normally withstand them. You ignore a creature’s necrotic resistance when you deal damage via spells or your Channel Divinity.\n\n##### Divine Strike\n\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 necrotic damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n#### Improved Death’s Cut\n\nBeginning at 17th level, your Death’s Cut feature can apply to spells of the necromancy school of up to 5th-level in addition to cantrips. However, you must double the amount of material components used if the spell calls for them.",
        "document__slug": "o5e",
        "document__title": "Open5e Original Content",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "open5e.com"
      },
      {
        "name": "Mischief Domain",
        "slug": "mischief-domain",
        "desc": "While most deities inspire awe with their might and power, some prefer subtler methods. Gods of the mischief domain favor cunning to advance their agendas, and they encourage this trait in the followers as well. Some deities of mischief, like Anansi and Hermes, are good natured tricksters. Some, like the impetuous Susanoo, vacillate between being helpful or hindering on a whim. Deities like Loki and Veles are primarily antagonistic to their respective pantheons, but their mercurial nature means they might make the odd alliance with their more serious kin. Gods associated with the moon, like Hecate, mirror the moon’s changing shape as patrons of mischief. Gods of fortune, like Tyche and Bes, are often tricksters who make their own luck. Meanwhile, culture heroes like Kokopelli, Lemminkäinen, and Maui often use deceit to bring prosperity to their people. These diverse deities count among their worshippers criminals, freedom fighters, and free spirits alike, united only by their willingness to upset the status quo. Some use tricks to lead people to a greater truth, while others use mischief to stay one step ahead of the competition.\n\n**Mischeif Domain Spells (table)**\n\n| Cleric Level | Spells                           |\n|--------------|----------------------------------|\n| 1st          | charm person, disguise self      |\n| 3rd          | mirror image, pass without trace |\n| 5th          | blink, dispel magic              |\n| 7th          | dimension door, polymorph        |\n| 9th          | dominate person, modify memory   |\n\n#### Spreader of Mischief\n\nAt 1st level, when you choose this domain, you can endow others with the power to make mischief. As an action, you may touch a willing creature, and that creature gains advantage when making Dexterity (Stealth) checks for the next hour. The effect ends early if you use the feature on a different creature. You may not use this feature on yourself.\n\n#### Channel Divinity: Double Trouble\n\nOnce you reach 2nd level, you gain the power to create an illusory double of yourself with the Channel Divinity class feature. You may use your action to manifest the illusion in an unoccupied space visible to you and within 30 feet of yourself. You must concentrate to maintain the illusion as if it were a spell, and you can do so for up to 1 minute. On your turn, you can use a bonus action to move up to 30 feet, but it must remain in your view and cannot move more than 120 feet away from you.\n\nWhile you maintain the illusion, when you cast a spell, you can use the position of the illusion rather than your own for determining range, area of effect, and line of sight. However, you cannot actually “see” through the illusion’s eyes, so you must rely on your own vision if the spell requires you to see a target or space.\n\nYour illusion can disorient foes, so you gain advantage on attack rolls against any creature that can see the illusion if both you and the illusion are within 5 feet of the creature.\n\n#### Channel Divinity: Walk Unseen\n\nBeginning at 6th level, with your Channel Divinity feature, you can use an action to become invisible. This invisibility lasts until the end of your next turn, or if you cast a spell or attack.\n\n#### Divine Strike\n\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n#### Double Trouble Doubled\n\nStarting at 17th level, your Double Trouble feature becomes more potent. Instead of one double, you can create up to four, and you can move as many of them as you like on your turn with a bonus action following the rules outlined in that feature.",
        "document__slug": "o5e",
        "document__title": "Open5e Original Content",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "open5e.com"
      },
      {
        "name": "Storm Domain",
        "slug": "storm-domain",
        "desc": "Nothing inspires fear in mortals quite like a raging storm. This domain encompasses deities such as Enlil, Indra, Raijin, Taranis, Zeus, and Zojz. Many of these are the rulers of their respective pantheons, wielding the thunderbolt as a symbol of divine might. Most reside in the sky, but the domain also includes lords of the sea (like Donbettyr) and even the occasional chthonic fire deity (such as Pele). They can be benevolent (like Tlaloc), nourishing crops with life-giving rain; they can also be martial deities (such as Perun and Thor), splitting oaks with axes of lightning or battering their foes with thunderous hammers; and some (like Tiamat) are fearsome destroyers, spoken of only in whispers so as to avoid drawing their malevolent attention. Whatever their character, the awesome power of their wrath cannot be denied.\n\n**Storm Domain Spells (table)**\n\n| Cleric Level | Spells                               |\n|--------------|---------------------------------|\n| 1st          | fog cloud, thunderwave          |\n| 3rd          | gust of wind, shatter           |\n| 5th          | call lightning, sleet storm     |\n| 7th          | control water, ice storm        |\n| 9th          | destructive wave, insect plague |\n\n##### Bonus Proficiency\n\nWhen you choose this domain at 1st level, you gain proficiency with heavy armor as well as with martial weapons.\n\n##### Tempest’s Rebuke\n\nAlso starting at 1st level, you can strike back at your adversaries with thunder and lightning. If a creature hits you with an attack, you can use your reaction to target it with this ability. The creature must be within 5 feet of you, and you must be able to see it. The creature must make a Dexterity saving throw, taking 2d8 damage on a failure. On a success, the creature takes only half damage. You may choose to deal either lightning or thunder damage with this ability.\n\nYou may use this feature a number of times equal to your Wisdom modifier (at least once). When you finish a long rest, you regain your expended uses.\n\n##### Channel Divinity: Full Fury\n\nStarting at 2nd level, you can use your Channel Divinity to increase the fury of your storm based attacks. Whenever you would deal lightning or thunder damage from an attack, rather than roll damage, you can use the Channel Divinity feature to deal the maximum possible damage.\n\n##### Storm Blast\n\nBeginning at 6th level, you can choose to push a Large or smaller creature up to 10 feet away from you any time you deal lightning damage to it.\n\n##### Divine Strike\n\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Sky’s Blessing\n\nStarting at 17th level, you gain a flying speed whenever you are outdoors. Your flying speed is equal to your present walking speed.",
        "document__slug": "o5e",
        "document__title": "Open5e Original Content",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "open5e.com"
      }
    ],
    "document__slug": "wotc-srd",
    "document__title": "5e Core Rules",
    "document__license_url": "http://open5e.com/legal",
    "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"
  }
}